balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18LF66K80.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF0SIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF0SIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0xff" edc:name="SID" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-n-nn" edc:cname="RXF0SIDL" edc:desc="" edc:impl="0xeb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuu-u-uu" edc:name="RXF0SIDL" edc:nzwidth="0x8" edc:por="xxx-x-xx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3" edc:name="EID" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EXIDEN" edc:desc="" edc:mask="0x1" edc:name="EXIDEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7" edc:name="SID" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF0EIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF0EIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0xff" edc:name="EID" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF0EIDL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF0EIDL" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0xff" edc:name="EID" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF1SIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF1SIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0xff" edc:name="SID" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-n-nn" edc:cname="RXF1SIDL" edc:desc="" edc:impl="0xeb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuu-u-uu" edc:name="RXF1SIDL" edc:nzwidth="0x8" edc:por="xxx-x-xx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3" edc:name="EID" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EXIDEN" edc:desc="" edc:mask="0x1" edc:name="EXIDEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7" edc:name="SID" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF1EIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF1EIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0xff" edc:name="EID" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF1EIDL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF1EIDL" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0xff" edc:name="EID" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF2SIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF2SIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0xff" edc:name="SID" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-n-nn" edc:cname="RXF2SIDL" edc:desc="" edc:impl="0xeb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuu-u-uu" edc:name="RXF2SIDL" edc:nzwidth="0x8" edc:por="xxx-x-xx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3" edc:name="EID" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EXIDEN" edc:desc="" edc:mask="0x1" edc:name="EXIDEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7" edc:name="SID" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF2EIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF2EIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0xff" edc:name="EID" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF2EIDL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF2EIDL" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0xff" edc:name="EID" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF3SIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF3SIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0xff" edc:name="SID" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
