balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18LF66K80.PIC
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB0D1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB0D1" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB0D1" edc:desc="" edc:mask="0xff" edc:name="RXB0D1" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RXB0D10" edc:desc="" edc:mask="0x1" edc:name="RXB0D10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D11" edc:desc="" edc:mask="0x1" edc:name="RXB0D11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D12" edc:desc="" edc:mask="0x1" edc:name="RXB0D12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D13" edc:desc="" edc:mask="0x1" edc:name="RXB0D13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D14" edc:desc="" edc:mask="0x1" edc:name="RXB0D14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D15" edc:desc="" edc:mask="0x1" edc:name="RXB0D15" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D16" edc:desc="" edc:mask="0x1" edc:name="RXB0D16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D17" edc:desc="" edc:mask="0x1" edc:name="RXB0D17" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB0D2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB0D2" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB0D2" edc:desc="" edc:mask="0xff" edc:name="RXB0D2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RXB0D20" edc:desc="" edc:mask="0x1" edc:name="RXB0D20" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D21" edc:desc="" edc:mask="0x1" edc:name="RXB0D21" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D22" edc:desc="" edc:mask="0x1" edc:name="RXB0D22" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D23" edc:desc="" edc:mask="0x1" edc:name="RXB0D23" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D24" edc:desc="" edc:mask="0x1" edc:name="RXB0D24" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D25" edc:desc="" edc:mask="0x1" edc:name="RXB0D25" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D26" edc:desc="" edc:mask="0x1" edc:name="RXB0D26" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D27" edc:desc="" edc:mask="0x1" edc:name="RXB0D27" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB0D3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB0D3" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB0D3" edc:desc="" edc:mask="0xff" edc:name="RXB0D3" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RXB0D30" edc:desc="" edc:mask="0x1" edc:name="RXB0D30" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D31" edc:desc="" edc:mask="0x1" edc:name="RXB0D31" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D32" edc:desc="" edc:mask="0x1" edc:name="RXB0D32" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D33" edc:desc="" edc:mask="0x1" edc:name="RXB0D33" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D34" edc:desc="" edc:mask="0x1" edc:name="RXB0D34" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D35" edc:desc="" edc:mask="0x1" edc:name="RXB0D35" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D36" edc:desc="" edc:mask="0x1" edc:name="RXB0D36" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D37" edc:desc="" edc:mask="0x1" edc:name="RXB0D37" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB0D4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB0D4" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB0D4" edc:desc="" edc:mask="0xff" edc:name="RXB0D4" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RXB0D40" edc:desc="" edc:mask="0x1" edc:name="RXB0D40" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D41" edc:desc="" edc:mask="0x1" edc:name="RXB0D41" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D42" edc:desc="" edc:mask="0x1" edc:name="RXB0D42" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D43" edc:desc="" edc:mask="0x1" edc:name="RXB0D43" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D44" edc:desc="" edc:mask="0x1" edc:name="RXB0D44" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D45" edc:desc="" edc:mask="0x1" edc:name="RXB0D45" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D46" edc:desc="" edc:mask="0x1" edc:name="RXB0D46" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D47" edc:desc="" edc:mask="0x1" edc:name="RXB0D47" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB0D5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB0D5" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB0D5" edc:desc="" edc:mask="0xff" edc:name="RXB0D5" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RXB0D50" edc:desc="" edc:mask="0x1" edc:name="RXB0D50" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D51" edc:desc="" edc:mask="0x1" edc:name="RXB0D51" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D52" edc:desc="" edc:mask="0x1" edc:name="RXB0D52" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D53" edc:desc="" edc:mask="0x1" edc:name="RXB0D53" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D54" edc:desc="" edc:mask="0x1" edc:name="RXB0D54" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D55" edc:desc="" edc:mask="0x1" edc:name="RXB0D55" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D56" edc:desc="" edc:mask="0x1" edc:name="RXB0D56" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D57" edc:desc="" edc:mask="0x1" edc:name="RXB0D57" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB0D6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB0D6" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB0D6" edc:desc="" edc:mask="0xff" edc:name="RXB0D6" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RXB0D60" edc:desc="" edc:mask="0x1" edc:name="RXB0D60" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D61" edc:desc="" edc:mask="0x1" edc:name="RXB0D61" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D62" edc:desc="" edc:mask="0x1" edc:name="RXB0D62" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D63" edc:desc="" edc:mask="0x1" edc:name="RXB0D63" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D64" edc:desc="" edc:mask="0x1" edc:name="RXB0D64" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D65" edc:desc="" edc:mask="0x1" edc:name="RXB0D65" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D66" edc:desc="" edc:mask="0x1" edc:name="RXB0D66" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D67" edc:desc="" edc:mask="0x1" edc:name="RXB0D67" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB0D7" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB0D7" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB0D7" edc:desc="" edc:mask="0xff" edc:name="RXB0D7" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RXB0D70" edc:desc="" edc:mask="0x1" edc:name="RXB0D70" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D71" edc:desc="" edc:mask="0x1" edc:name="RXB0D71" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D72" edc:desc="" edc:mask="0x1" edc:name="RXB0D72" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D73" edc:desc="" edc:mask="0x1" edc:name="RXB0D73" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D74" edc:desc="" edc:mask="0x1" edc:name="RXB0D74" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D75" edc:desc="" edc:mask="0x1" edc:name="RXB0D75" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D76" edc:desc="" edc:mask="0x1" edc:name="RXB0D76" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0D77" edc:desc="" edc:mask="0x1" edc:name="RXB0D77" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
